OpenFOAM/foam9tutorials/CFD/flameSpread_SBI/constant/panelRegion/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  opaqueSolid;

absorptionEmissionModel greyMeanSolidAbsorptionEmission;

greyMeanSolidAbsorptionEmissionCoeffs
{
    v
    {
        absorptivity    0.7; 
        emissivity      0.7;
    }

    char
    {
        absorptivity    0.86;
        emissivity      0.86;
    }
}

scatterModel    none;

// ************************************************************************* //
